#include "Chapter10.h"

namespace nsEverything
{
	void main()
	{
		// task1();
		// task2();
		// task3();
		// task4();
		// task5();
		// task6();
		// task7();
		// task8();
		// task9();
		// task10();
		task11();
	}


	// Задача 10.1. Инициализация. Часть 1(3)
	void task1()
	{

	}


	// Задача 10.2. Инициализация. Часть 2(3)
	void task2()
	{

	}


	// Задача 10.3.Корректность const(6)
	void task3()
	{

	}


	// Задача 10.4. Приведения(6)
	void task4()
	{

	}


	// Задача 10.5- bool(7)
	void task5()
	{

	}


	// Задача 10.6.Пересылающие функции(3)
	void task6()
	{

	}


	// Задача 10.7. Поток управления(6)
	void task7()
	{

	}


	// Задача 10.8. Предварительные объявления(3)
	void task8()
	{

	}


	// Задача 10.9. typedef(3)
	void task9()
	{

	}


	// Задача 10.10. Пространства имен. Часть 1(2)
	void task10()
	{

	}


	// Задача 10.11.Пространства имен.Часть 2(4)
	void task11()
	{

	}
}
