#include "Chapter4.h"

namespace nsFirewallAndPimpl
{
	void main()
	{
		// task1();
		// task2();
		// task3();
		// task4();
		task5();
	}


	// Задача 4.1. Минимизация зависимостей времени компиляции.Часть 1(4)
	void task1()
	{

	}


	// Задача 4.2. Минимизация зависимостей времени компиляции.Часть 2(6)
	void task2()
	{

	}


	// Задача 4.3. Минимизация зависимостей времени компиляции.Часть 3(7)
	void task3()
	{

	}


	// Задача 4.4. Брандмауэры компиляции(6)
	void task4()
	{

	}


	// Задача 4.5. Идиома "Fast Pimpl"(6)
	void task5()
	{

	}
}
